app/controllers/messages_controller.rb

INSERT INTO "messages" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["content", "test\r\n"], ["created_at", "2016-04-10 21:32:04.929015"], ["updated_at", "2016-04-10 21:32:04.929015"]]
---
  def create
    @message = Message.new(message_params)
    if @message.save