app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Matthew"], ["password", "password"], ["created_at", "2016-04-11 03:55:08.645680"], ["updated_at", "2016-04-11 03:55:08.645680"]]
---
  def create
    @user = User.new(user_params)
    if @user.save